export default [
  {
    "version": "v3.1.1",
    "date": "2025-10-16",
    "changes": [
      "Ciallo～(∠・ω＜)⌒★",
      "修复启用快捷方式“顶部菜单栏”会报错的bug",
      "增加“更新内容”阅读面板",
    ]
  },
  {
    "version": "v3.1.0",
    "date": "2025-10-15",
    "changes": [
      "Ciallo～(∠・ω＜)⌒★",
      "对扩展进行工程化改造，预适配工程化后的无名杀，兼容v1.10.10版本及以上的无名杀",
    ]
  },
  {
    "version": "v3.0.2",
    "date": "2025-09-13",
    "changes": [
      "Ciallo～(∠・ω＜)⌒★",
      "优化Toast组件的显示大小",
      "修复实时切换背景报错的bug",
      "适当放大手机端扩展管家的页面内容",
    ]
  },
  {
    "version": "v3.0.1",
    "date": "2025-09-11",
    "changes": [
      "修复卸载扩展无效的bug",
    ]
  },
  {
    "version": "v3.0.0",
    "date": "2025-09-10",
    "changes": [
      "最低适配：v.1.10.10本体",
      "增加暗黑主题",
      "增加可选快捷方式，“顶部菜单栏”或“悬浮按钮”",
      "增加新的页面：“游戏设置”，可以快捷导出/导入/管理游戏设置",
      "bug修复",
    ]
  },
]
